[[neo4j]]
= Introduction to Neo4j

== What is a graph database?

A graph database is a storage engine that is specialised in storing and retrieving vast networks of data. It efficiently
stores nodes and relationships and allows high performance traversal of those structures. Properties can be added to
nodes and relationships. Nodes can be labelled by zero or more labels, and relationships must have a direction and
exactly one type.

Graph databases are well suited for storing most kinds of domain models. In almost all domains, there are certain things
connected to other things. In most other modeling approaches, the relationships between things are reduced to a single
link without identity and attributes. Graph databases allow to keep the rich relationships that originate from the domain
equally well-represented in the database without resorting to also modeling the relationships as "things". There is very
little "impedance mismatch" when putting real-life domains into a graph database.

== About Neo4j

http://neo4j.org/[Neo4j] is a NOSQL graph database. It is a fully transactional database (ACID) that stores data
structured as graphs. A graph consists of nodes, connected by relationships. Inspired by the structure of the human mind,
it allows for high query performance on complex data, while remaining intuitive and simple for the developer.

Neo4j is very well-established.  It has been in commercial development for 15 years and in production for over 12 years. Most importantly, it has a helpful and contributing community surrounding it, but it also:

* has an intuitive, rich graph-oriented model for data representation. Instead of tables, rows, and columns, you work with a graph consisting of http://neo4j.com/docs/stable/what-is-a-graphdb.html[nodes, relationships, and properties].
* has a disk-based, native storage manager optimized for storing graph structures with maximum performance and scalability.
* is scalable. Neo4j can handle graphs with many billions of nodes/relationships/properties on a single machine, but can also be scaled out across multiple machines for high availability.
* has a powerful graph query language called Cypher, which allows users to efficiently read/write data by expressing graph patterns.
* has a powerful traversal framework and query languages for traversing the graph.
* can be deployed as a standalone server, which is the recommended way of using Neo4j
* can be deployed as an embedded (in-process) database, giving developers access to its core Java http://api.neo4j.org/[API]

In addition, Neo4j has ACID transactions, durable persistence, concurrency control, transaction recovery, high availability, and more. Neo4j is released under a dual free software/commercial licence model.

== Querying the Graph with Cypher

Neo4j provides a graph query language called http://neo4j.com/docs/stable/cypher-query-lang.html["Cypher"] which
draws from many sources. It resembles SQL but with an iconic representation of patterns in the graph (concepts drawn from SPARQL).
The Cypher execution engine was written in Scala to leverage the high expressiveness for lazy sequence operations of
the language and the parser combinator library.

Cypher queries typically begin with a `MATCH` clause, which can be used to provide a way to pattern match against a
starting set of nodes, via their IDs or label-based index lookup. These starting patterns or start nodes, are then
related to other nodes via additional `MATCH` clauses. Match clauses can introduce new identifiers for nodes and relationships.
In the `WHERE` clause additional filtering of the result set is applied by evaluating expressions. The `RETURN` clause
defines which part of the query result will be available. Aggregation also happens in the return clause by using
aggregation functions on some of the values. Sorting can happen in the `ORDER BY` clause and the `SKIP` and `LIMIT`
parts restrict the result set to a certain window.

Cypher can be executed against a Neo4j server using an HTTP request.

.Cypher Examples on the Cineasts.net Dataset
====
[source]
----
// Actors who acted in a Matrix movie:
MATCH (movie:Movie)<-[:ACTS_IN]-(actor)
WHERE movie.title =~ 'Matrix.*'
RETURN actor.name, actor.birthplace

// User-Ratings:
MATCH (user:User {login:'micha'})-[r:RATED]->(movie) 
WHERE r.stars > 3
RETURN movie.title, r.stars, r.comment

// Mutual Friend recommendations:
MATCH (user:User {login:'micha'})-[:FRIEND]-(friend)-[r:RATED]->(movie) 
WHERE r.stars > 3
RETURN friend.name, movie.title, r.stars, r.comment

// Movie suggestions based on an actor:
MATCH (movie:Movie)<-[:ACTS_IN]-()-[:ACTS_IN]->(suggestion:Movie) 
WHERE id(movie)=13
RETURN suggestion.title, count(*) ORDER BY count(*) DESC LIMIT 5

// Co-Actors, sorted by count and name of Lucy Liu
MATCH (lucy)-[:ACTS_IN]->(movie)<-[:ACTS_IN]-(co_actor) 
WHERE lucy.name='Lucy Liu'
RETURN count(*), co_actor.name ORDER BY count(*) DESC, co_actor.name LIMIT 20

// Recommendations including counts, grouping and sorting
MATCH (:User {login:'micha'})-[:FRIEND]-()-[r:RATED]->(movie) 
RETURN movie.title, avg(r.stars), count(*) ORDER BY avg(r.stars) DESC, count(*) DESC
----
====

== Indexing

The best way for retrieving start nodes for traversals and queries is by using Neo4j's integrated index facilities.
Spring Data Neo4j takes the view that index maintenance should not be part of your application code. For that reason,
it does not provide any explicit index-related functionality.

However, it is very important that indices are in place for efficient node lookups.
Please make sure you read http://neo4j.com/docs/stable/query-schema-index.html[Neo4j Documentation]
on indices.



